In [1]:
import pandas as pd

data = {'A':[1,2,3], 'B':[4,5,6], 'C':[7,8,9]}

df = pd.DataFrame(data, index=['a', 'b', 'c'])
df

   A  B  C
a  1  4  7
b  2  5  8
c  3  6  9

In [4]:
df.loc['a',"A"]

1

In [5]:
df.loc[['a'],['A']]

   A
a  1

In [6]:
df.loc[['b','c'], ['C']]

   C
b  8
c  9

In [13]:
import pandas as pd

data = {'name' : ['Alice', 'Bob', 'Charlie', 'David', 'Emily'],
        'age'  : [25, 30, 35, 40, 45],
        'score': [88, 92, 95, 70, 65]}

df = pd.DataFrame(data)
df

      name  age  score
0    Alice   25     88
1      Bob   30     92
2  Charlie   35     95
3    David   40     70
4    Emily   45     65

In [8]:
df.iloc[0:2,0:]

    name  age  score
0  Alice   25     88
1    Bob   30     92

In [18]:
aa = df.loc[[0],["name","score"]] # 默认 序号是数字，此时 .loc() 也可使用“数字”引用元素
print(aa)

    name  score
0  Alice     88

In [17]:
len(df) # 数据的数目

5

In [19]:
df.iloc[[0,3,4]]

    name  age  score
0  Alice   25     88
3  David   40     70
4  Emily   45     65